src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>МатериалыСобственные</name>
      <description>Материалы (собственные)</description>
    </items>
    <items>
      <name>МатериалыКлиента</name>
      <description>Материалы клиента</description>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
    </items>
    <items>
      <name>Услуги</name>
      <description>Услуги</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьУслуги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетБухгалтерскогоУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>МатериалКлиента</name>
  </enumValues>
</mdclass:Enum>

src/ChartsOfAccounts/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Хозрасчетный</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконтоХозрасчетные</extDimensionTypes>
  <predefined>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
      <code>10</code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
    </items>
    <items>
      <name>РасходыНаПродажу</name>
      <description>Расходы на продажу</description>
      <code>44</code>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
    </items>
    <items>
      <name>РасчетыСПоставщиками</name>
      <description>Расчет с поставщиками</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыСПокупателями</name>
      <description>Расчеты с покупателями</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыСПерсоналомПоОплатеТруда</name>
      <description>Расчеты с персоналом по оплате труда</description>
      <code>70</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыСПодотчетнымиЛицами</name>
      <description>Расчет с подотчетными лицами</description>
      <code>71</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ПрочиеДоходыИРасходы</name>
      <description>Прочие доходы и расходы</description>
      <code>91</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
</mdclass:ChartOfAccounts>

src/Catalogs/Номенклатура/Forms/ФормаЭлемента/Module.bsl
// Форма элемента справочника "Номенклатура".
// Управляет видимостью реквизитов и подбором счёта бухгалтерского учёта
// в зависимости от выбранного типа номенклатуры (Товар, Услуга, Материал и т.д.).

#Область ОбработчикиСобытийФормы

// При открытии формы скрываем или показываем поле "ДлительностьУслуги".
// Для материальных типов (Материал, Товар, МатериалКлиента) длительность не нужна,
// для услуг и прочих — показываем.
&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Материал") 
        ИЛИ Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар")
        ИЛИ Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МатериалКлиента") Тогда 
        Элементы.ДлительностьУслуги.Видимость = Ложь;
    Иначе
        Элементы.ДлительностьУслуги.Видимость = Истина;
    КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// При изменении типа номенклатуры пользователем обновляем видимость поля "ДлительностьУслуги"
// и сразу подбираем соответствующий счёт бухгалтерского учёта через серверный вызов.
&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
    Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Материал") 
        ИЛИ Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар")
        ИЛИ Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МатериалКлиента") Тогда 
        Элементы.ДлительностьУслуги.Видимость = Ложь;
    Иначе
        Элементы.ДлительностьУслуги.Видимость = Истина;
    КонецЕсли; 
    Объект.СчетБухгалтерскогоУчета = ОпределитьСчетПоТипуНоменклатуры(Объект.ТипНоменклатуры);
КонецПроцедуры

// Обработчик начала выбора для поля "СчетБухгалтерскогоУчета".
// Формирует ограниченный список доступных счетов в зависимости от типа номенклатуры,
// чтобы пользователь не мог выбрать неподходящий счёт.
&НаКлиенте
Процедура СчетБухгалтерскогоУчетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    
    СписокДоступныхЗначений = Новый СписокЗначений;    
    Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда
        СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Товары"));
    ИначеЕсли  
        Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
        СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.РасходыНаПродажу"));
        СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПрочиеДоходыИРасходы"));
    ИначеЕсли
        Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Материал") Тогда
        СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Материалы"));
    Иначе    
        СписокДоступныхЗначений.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПустаяСсылка"));
    КонецЕсли;
    
    ДанныеВыбора = СписокДоступныхЗначений;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Серверная функция, возвращающая счёт бухучёта по типу номенклатуры.
// Параметры:
//   ТипНоменклатуры - ПеречислениеСсылка.ТипыНоменклатуры - тип номенклатуры.
// Возвращает:
//   ПланСчетовСсылка.Хозрасчетный - предопределённый счёт, соответствующий типу,
//   или Неопределено для неизвестных типов.
&НаСервере
Функция ОпределитьСчетПоТипуНоменклатуры(ТипНоменклатуры)
    Если ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда
        Возврат ПланыСчетов.Хозрасчетный.НайтиПоКоду("41");
    ИначеЕсли 
        ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
        Возврат ПланыСчетов.Хозрасчетный.НайтиПоКоду("44");
    ИначеЕсли
        ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Материал") Тогда
        Возврат ПланыСчетов.Хозрасчетный.НайтиПоКоду("10");
    Иначе
        Возврат Неопределено;
    КонецЕсли;
КонецФункции

#КонецОбласти
